In [1]:
#task1  (lesson8)
#oracle: https://leetcode.com/problems/department-top-three-salaries/
request = """
select d.name as Department, t1.name as Employee, t1.Salary as Salary 
FROM (
    SELECT e.*, DENSE_RANK() OVER(PARTITION BY DepartmentId ORDER BY Salary DESC) AS rank
    FROM Employee e) t1
LEFT JOIN Department d
ON t1.DepartmentId = d.Id
WHERE t1.rank <= 3
ORDER BY Salary DESC;
"""

In [ ]:
#task2  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/17
request = """
SELECT member_name, status, sum(amount*unit_price) as costs
from FamilyMembers f
join Payments p
on f.member_id=p.family_member
where p.date like '2005%'
GROUP BY f.member_name, f.status;
"""

In [ ]:
#task3  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/13
request = """
select name
from Passenger
group by name
having count(name)>1;
"""

In [ ]:
#task4  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/38
request = """
select count(first_name) AS COUNT 
FROM Student
where first_name = 'Anna';
"""

In [ ]:
#task5  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/35
request = """
select count(classroom) as count
from Schedule
where date like '2019-09-02%';
"""

In [ ]:
#task6  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/38
request = """
select count(first_name) as count
from Student
where first_name = 'Anna';
"""

In [ ]:
#task7  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/32
request = """
SELECT floor(avg(year(curdate()) - year(birthday)- (DATE_FORMAT(curdate(), '%m%d') < DATE_FORMAT(birthday, '%m%d')))) as age
from FamilyMembers;
"""

In [ ]:
#task8  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/27
request = """
SELECT gt.good_type_name, sum(p.amount*p.unit_price) as costs
from Payments p
left join Goods g
on p.good = g.good_id
left join GoodTypes gt
on g.type = gt.good_type_id
where p.date like '2005%'
GROUP BY gt.good_type_name;
"""

In [ ]:
#task9  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/37
request = """
SELECT min(year(curdate()) - year(birthday)- (DATE_FORMAT(curdate(), '%m%d') < DATE_FORMAT(birthday, '%m%d'))) as year
from Student;
"""

In [ ]:
#task10  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/44
request = """
SELECT max(year(curdate())-year(birthday)) as max_year
FROM Student s
left join Student_in_class sc
on s.id=sc.student
left join Class cls
on sc.class = cls.id 
where cls.name like'10%';
"""

In [ ]:
#task11 (lesson8)
#https://sql-academy.org/ru/trainer/tasks/20
request = """
select status, member_name, sum(p.amount*p.unit_price) as costs
from FamilyMembers f
left join Payments p
on f.member_id=p.family_member
left join Goods g
on g.good_id = p.good
left join GoodTypes gt
on gt.good_type_id=g.type
where gt.good_type_name = 'entertainment'
GROUP BY status, member_name;
"""

In [ ]:
#task12  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/55
request = """
DELETE FROM Company
WHERE id in (
    SELECT t2.Company from (
        SELECT Company, count(id) as cnt FROM Trip
        GROUP BY Company
        HAVING cnt = (SELECT min(cnt) from (
            SELECT Company, count(id) as cnt FROM Trip
            GROUP BY Company) t1)
    ) t2
);
"""

In [ ]:
#task13  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/45
request = """
  SELECT classroom
    FROM Schedule
GROUP BY classroom
ORDER BY COUNT(*) DESC 
LIMIT 2;
"""

In [ ]:
#task14  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/43
request = """
select  last_name
from Teacher t
LEFT JOIN Schedule s
on t.id=s.teacher
LEFT JOIN Subject st
on st.id=s.subject
where name = 'Physical Culture'
ORDER BY last_name;
"""

In [ ]:
#task15  (lesson8)
#https://sql-academy.org/ru/trainer/tasks/63
request = """
select concat(last_name,'.',substr(first_name, 1, 1),'.',substr(middle_name, 1, 1),'.') as name
FROM Student 
ORDER BY concat(last_name,'.',substr(first_name, 1, 1),'.',substr(middle_name, 1, 1)); 
"""